app/controllers/posts_controller.rb

  def index
  @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "good morning"], ["created_at", "2014-05-04 01:04:49.070395"], ["name", "ys"], ["title", "hello"], ["updated_at", "2014-05-04 01:04:49.070395"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "helloㅇㅇ"], ["updated_at", "2014-05-05 13:59:55.385577"]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]